
// ====== Модификаторы доступа для членов класса ======

// 1. private

// 2. protected

// 3. public

// 4. private protected         (наследник в текущей сборке)

// 5. internal                  (всем внутри текущей сборки, закрыто для внешних сборок)
//                              (private public)

// 6. protected internal        (всем внутри текущей сборки, для наследников во внешних сборках)
//                              (protected public)


// ====== Модификаторы для типа в целом =======

// 1. internal

// 2. public

// 3. file

